## 第六次练习

+ 请务必交到exer6文件夹下，**谢绝交到master下**
+ 请不要改动任何文件，拜托
+ 请在12月4日前提交。

请写一下姓名和学号：
+ 姓名  陈冲
+ 学号  0160908

### 请建立一个数据框，列出你在双十一购买的至少五样物品。
用它们的名称作为index的label，在列里列出这些物品（数据可以是虚拟的）的：
+ 价格
+ 购买的数量
+ 收到的时间（类似1113即可，表示11月13日收到）
+ 你的评价（从1到5，1表示很不好，5表示很好）

#### 用index的label读取某一个物品数据

#### 选择价格>200的物品

In [47]:
import pandas as pd

In [48]:
from pandas import Series, DataFrame

In [49]:
shopping= {
    'price': [699,50,255, 150], 
    'amount': [1,2,1,2], 
    'receving_time': [1120,1115,1115,1122],
    'assessment':[5,4,5,4]
       }

frame = pd.DataFrame(shopping,index=['shoes','books','clothes','sweater'])

frame

         price  amount  receving_time  assessment
shoes      699       1           1120           5
books       50       2           1115           4
clothes    255       1           1115           5
sweater    150       2           1122           4

In [50]:
frame.loc['clothes']

price             255
amount              1
receving_time    1115
assessment          5
Name: clothes, dtype: int64

In [51]:
frame[frame['price']>200]

         price  amount  receving_time  assessment
shoes      699       1           1120           5
clothes    255       1           1115           5

#### 挑选其中和学习有关的物品，构成一个子集

In [52]:
frame.loc[['books'],['amount','price','receiving_time','assessment']]

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

       amount  price  receiving_time  assessment
books       2     50             NaN           4

#### 读取评价那列的数据

In [53]:
frame['assessment']

shoes      5
books      4
clothes    5
sweater    4
Name: assessment, dtype: int64

#### 根据label对数据框重新排序，按照对你的迫切程度

In [54]:
frame1=frame.reindex(['books','shoes','clothes','sweater'])
frame1

         price  amount  receving_time  assessment
books       50       2           1115           4
shoes      699       1           1120           5
clothes    255       1           1115           5
sweater    150       2           1122           4

#### 生成一个series，记录这些物品的快递费，然后加到价格上

In [56]:
freight_fees=pd.Series([0,0,10,20],index=['books','sweater','clothes','shoes'])
frame['price']=frame['price']+freight_fees
frame

         price  amount  receving_time  assessment
shoes      719       1           1120           5
books       50       2           1115           4
clothes    265       1           1115           5
sweater    150       2           1122           4

#### 按照价格从高到底排序

In [58]:
frame.sort_values(by='price',ascending=False)

         price  amount  receving_time  assessment
shoes      719       1           1120           5
clothes    265       1           1115           5
sweater    150       2           1122           4
books       50       2           1115           4

#### 按照收到的时间从低到高排序

In [59]:
frame.sort_values(by='receving_time')

         price  amount  receving_time  assessment
books       50       2           1115           4
clothes    265       1           1115           5
shoes      719       1           1120           5
sweater    150       2           1122           4

#### 得到各样物品评价的排名

In [60]:
new_frame=frame['assessment']
new_frame.rank(method='min')

shoes      3.0
books      1.0
clothes    3.0
sweater    1.0
Name: assessment, dtype: float64

#### 计算一下这些物品的总花费、最大值、最小值和平均值

In [61]:
frame['total_fees']=frame['price']*frame['amount']
frame

         price  amount  receving_time  assessment  total_fees
shoes      719       1           1120           5         719
books       50       2           1115           4         100
clothes    265       1           1115           5         265
sweater    150       2           1122           4         300

In [62]:
frame['total_fees'].sum()

1384

In [63]:
frame['total_fees'].max()

719

In [64]:
frame['total_fees'].min()

100

In [65]:
average=frame['total_fees'].sum()/frame['amount'].sum()
average

230.66666666666666